In [1]:
import numpy as np
import pandas as pd
import scipy.stats as sp

In [2]:
df = pd.read_csv('income.csv')

In [3]:
values = np.array([3,4,6,2,12,4,5,7,3,2,4,6,7,40])

In [4]:
mean = values.mean()
print(mean)

7.5

In [5]:
median = np.median(values)
print(median)

4.5

In [6]:
mode = sp.mode(values)[0]
print(mode)

4

In [7]:
q_25 = np.quantile(values, 0.25)
q_50 = np.quantile(values, 0.5) #(0.5 quantile or 50% percentile) is the same as median
q_75 = np.quantile(values, 0.75)
print(q_25)
print(q_50)
print(q_75)

3.25
4.5
6.75

In [8]:
pd.read_csv('income.csv', names =['name', 'income'])

        name    income
0       name    income
1        Rob      5000
2      Rafiq      6000
3       Nina      4000
4      Sofia      7500
5      Mohan      8000
6        Toa      7000
7  Elon Musk  10000000

In [9]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [10]:
df.income.quantile()

np.float64(7000.0)

In [11]:
df.income.quantile(0.75)

np.float64(7750.0)

In [12]:
df.income.quantile(0.45)

np.float64(6700.0)

In [13]:
df.income.quantile(0.25)

np.float64(5500.0)

In [14]:
df.income.quantile(0.25, interpolation = 'lower')

np.int64(5000)

In [15]:
df.income.quantile(0.24, interpolation= 'higher')

np.int64(6000)

In [16]:
df.income.quantile(0)

np.float64(4000.0)

In [17]:
df.income.quantile(1)

np.float64(10000000.0)

In [29]:
percentile_99 = df.income.quantile(0.99)

In [30]:
no_outlier = df[df.income<=percentile_99]
no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Toa    7000

In [18]:
df['income'][3] = np.nan
df

C:\Users\niral\AppData\Local\Temp\ipykernel_9344\289859548.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3] = np.nan
C:\Users\niral\AppData\Local\Temp\ipykernel_9344\289859548.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.nan

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Toa      7000.0
6  Elon Musk  10000000.0

In [32]:
missingvalue = df.income.median()

In [33]:
df_new = df.fillna(missingvalue)
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Toa      7000.0
6  Elon Musk  10000000.0

In [34]:
df_new.income.var()

np.float64(14268340321428.57)

In [35]:
df_new.income.std()

np.float64(3777345.6714243894)

In [37]:
3777345.6714243894*3777345.6714243894

14268340321428.57